{
    "palabras": [
        {"palabra": "Acomodación lingüística","definiciones": "El ajuste consciente o inconsciente del habla de una persona para hacerla más similar a la de su interlocutor. Puede implicar cambios en el vocabulario, el tono o la estructura del lenguaje para facilitar la comunicación o ganar aceptación social en un grupo determinado."},
        {"palabra": "Actitudes lingüísticas","definiciones": "Son las percepciones, creencias y sentimientos de las personas hacia una lengua o variedad lingüística. Estas actitudes pueden influir en cómo se utiliza, se valora o se considera una lengua, y pueden estar relacionadas con el prestigio, la identidad cultural o los estereotipos sociales asociados a esa lengua."},
        {"palabra": "Acto comunicativo","definiciones": "Cualquier interacción verbal o no verbal intencionada entre dos o más personas que implica el intercambio de información, emociones o ideas. Puede incluir gestos, palabras, expresiones faciales y tono de voz."},
        {"palabra": "Acto de habla","definiciones": "Unidades fundamentales de la comunicación que representan la intención del hablante al comunicarse. Van más allá de las palabras y comprenden la intención, el contexto y la efectividad comunicativa, como prometer, ordenar, preguntar o disculparse."},
        {"palabra": "Adopción lingüística","definiciones": "El proceso mediante el cual una persona o una comunidad adopta y comienza a usar una nueva lengua, ya sea como segunda lengua o como lengua principal. Este proceso puede ser individual o colectivo y puede involucrar cambios en la identidad lingüística y cultural."},
        {"palabra": "Adstrato lingüístico","definiciones": "Se refiere a la influencia que una lengua o dialecto ejerce sobre otra debido a la proximidad geográfica o cultural. Esto lleva a préstamos lingüísticos, cambios en el vocabulario o en la gramática de una lengua debido a la interacción con otra."},
        {"palabra": "Aglomeración dialectal","definiciones": "Es la agrupación de dialectos similares en una región geográfica específica. Se caracteriza por la presencia de variedades lingüísticas que comparten rasgos comunes dentro de un área geográfica limitada."},
        {"palabra": "Aglosia","definiciones": "Es la pérdida o la incapacidad para comprender el lenguaje, generalmente como resultado de daños en el área del cerebro que controla el procesamiento del lenguaje. Esto puede afectar la capacidad de comprender, procesar o producir el lenguaje de manera efectiva."},
        {"palabra": "Aglutinación lingüística","definiciones": "Es un proceso morfológico en el que se añaden afijos o morfemas a una raíz o lexema, uno tras otro, para formar palabras más largas y complejas. Este proceso es común en lenguas aglutinantes, donde los elementos se unen de manera clara y se puede identificar fácilmente la estructura morfológica de las palabras."},
        {"palabra": "Aislamiento dialectal","definiciones": "Se refiere a la situación donde los hablantes de un dialecto específico tienen poca interacción con otros hablantes de su misma lengua, lo que lleva al desarrollo y conservación de rasgos lingüísticos únicos y distintivos en su dialecto, a menudo debido a barreras geográficas, sociales o históricas que limitan el contacto lingüístico con otros grupos."},
        {"palabra": "Análisis de discurso","definiciones": "Estudio que examina cómo el lenguaje se utiliza en contextos sociales y culturales específicos, considerando factores como el poder, la identidad, las estructuras gramaticales y el significado en diferentes tipos de discurso, como textos, conversaciones o discursos públicos."},
        {"palabra": "Aplacación lingüística","definiciones": "Proceso en el que un elemento lingüístico adoptado de una lengua o dialecto se integra y se adapta a otro sistema lingüístico, generalmente debido al contacto entre lenguas, resultando en cambios estructurales o gramaticales en la lengua receptora."},
        {"palabra": "Área dialectal","definiciones": "Región geográfica donde se habla un dialecto o variante lingüística particular que comparte características distintivas con otras áreas circundantes, a menudo marcadas por diferencias fonéticas, léxicas o gramaticales."},
        {"palabra": "Argot","definiciones": "Lenguaje especializado y informal utilizado por grupos específicos, como profesionales, subculturas o comunidades cerradas, que incluye términos, jerga o expresiones propias del grupo y que a menudo no son fácilmente comprendidos por quienes no pertenecen a él."},
        {"palabra": "Asimilación lingüística","definiciones": "Proceso mediante el cual un individuo o grupo adopta y se adapta a una nueva lengua o variedad lingüística, absorbiendo sus estructuras y patrones lingüísticos, y a menudo abandonando o modificando aspectos de su lengua original para integrarse en la nueva comunidad lingüística."},
        {"palabra": "Bilingüismo","definiciones": "Es la capacidad de una persona para utilizar dos idiomas con fluidez. Esto puede implicar el dominio equitativo de ambos idiomas o una competencia superior en uno respecto al otro."},
        {"palabra": "Bilingüismo secuencial","definiciones": "Se refiere a la adquisición de una segunda lengua después de haber adquirido la primera. Por ejemplo, cuando alguien aprende un segundo idioma en la escuela o más tarde en la vida."},
        {"palabra": "Bilingüismo simultáneo","definiciones": "Ocurre cuando una persona adquiere dos idiomas de manera simultánea desde la infancia, generalmente porque está expuesta a ambos idiomas en su entorno familiar desde una edad temprana."},
        {"palabra": "Borrador social","definiciones": "Se refiere a las variaciones en el lenguaje utilizadas por una persona dependiendo del contexto social. Estas variaciones pueden incluir el uso de diferentes dialectos, registros lingüísticos o niveles de formalidad según el entorno social en el que se encuentre."},
        {"palabra": "Cambio de código","definiciones": "Es el fenómeno en el que un hablante alterna o cambia entre dos o más lenguas o dialectos dentro de una conversación o discurso. Este cambio puede ser debido a factores como la comodidad, la identidad social o la expresión de ciertos significados o emociones que pueden ser mejor comunicados en una lengua específica."},
        {"palabra": "Cambio fonológico","definiciones": "Alteración en los sonidos de un idioma a lo largo del tiempo. Esto implica modificaciones en la pronunciación de ciertos sonidos o en la estructura de los mismos dentro de una lengua. Por ejemplo, cambios en la manera en que se pronuncian las vocales o las consonantes en un idioma a lo largo de las generaciones."},
        {"palabra": "Cambio léxico","definiciones": "Modificación en el vocabulario de una lengua con el paso del tiempo. Este tipo de cambio implica la adición de nuevas palabras, la pérdida de otras o la transformación del significado de términos existentes. Por ejemplo, la incorporación de palabras extranjeras, la evolución de términos existentes o la desaparición de palabras en desuso."},
        {"palabra": "Cambio lingüístico","definiciones": "Transformación general en la estructura o funcionamiento de una lengua a lo largo del tiempo. Incluye cambios fonológicos, léxicos, sintácticos y gramaticales que afectan la forma en que se habla un idioma. Este cambio puede ser gradual y afectar diferentes aspectos del lenguaje."},
        {"palabra": "Cambio sintáctico","definiciones": "Alteración en la estructura gramatical de una lengua. Este cambio implica modificaciones en la forma en que se organizan las palabras para crear significado y cómo se construyen las frases. Por ejemplo, cambios en la disposición de palabras, la función de ciertas construcciones gramaticales o la evolución de reglas sintácticas."},
        {"palabra": "Característica lingüística","definiciones": "Rasgo o elemento distintivo presente en una lengua que puede manifestarse en diversos niveles, como fonológico, léxico, sintáctico o gramatical. Estas características pueden ser particularidades propias de una lengua o de un grupo lingüístico, como patrones de entonación, palabras específicas, reglas gramaticales o estructuras sintácticas particulares que identifican o distinguen un idioma."},
        {"palabra": "Clase social lingüística","definiciones": "Esta noción se refiere a la relación entre el estatus social de una persona y su forma de hablar. Se observa cómo la posición socioeconómica influye en el lenguaje, reflejando diferencias lingüísticas asociadas con diferentes estratos sociales. Las variaciones en el vocabulario, la pronunciación o la gramática pueden estar vinculadas a la pertenencia a determinados grupos sociales."},
        {"palabra": "Code-switching","definiciones": "Es el fenómeno lingüístico donde un hablante alterna entre dos o más lenguas o variedades lingüísticas dentro de una conversación. Ocurre comúnmente en contextos multilingües, donde los hablantes eligen palabras o estructuras de diferentes lenguas según el contexto o el interlocutor."},
        {"palabra": "Código cultural","definiciones": "Se refiere a los aspectos no lingüísticos, como normas, valores, prácticas y creencias compartidas por un grupo cultural específico. Estos códigos culturales pueden influir en la comunicación, afectando el significado y la interpretación del lenguaje utilizado en un contexto dado."},
        {"palabra": "Código de registro","definiciones": "Es el estilo o nivel de formalidad del lenguaje adaptado por un hablante en función del contexto comunicativo. Los códigos de registro varían desde el lenguaje informal y coloquial hasta el formal o técnico, utilizados en diferentes situaciones sociales o profesionales."},
        {"palabra": "Código lingüístico","definiciones": "Sistema de reglas y convenciones que gobiernan el uso de un idioma o variedad lingüística particular. Este código incluye reglas gramaticales, vocabulario, pronunciación y estructuras que son compartidas y comprendidas por los hablantes de una lengua o comunidad lingüística específica."},
        {"palabra": "Competencia lingüística","definiciones": "Conjunto de conocimientos que posee un hablante sobre su lengua, incluyendo la gramática, vocabulario, pronunciación y habilidades comunicativas. Esta competencia permite comprender, producir y utilizar el lenguaje de manera efectiva en diversas situaciones."},
        {"palabra": "Actuación lingüística","definiciones": "Uso real y práctico del lenguaje por parte de un hablante en situaciones específicas. Se refiere a la manera en que una persona aplica su competencia lingüística al comunicarse, adaptando su discurso según el contexto, el interlocutor y el propósito de la comunicación."},
        {"palabra": "Comunidad cerrada","definiciones": "Grupo social con fronteras definidas y acceso limitado, donde los miembros comparten intereses comunes, valores o prácticas. En el contexto lingüístico, puede referirse a grupos específicos que mantienen un lenguaje especializado o un registro particular, como comunidades científicas o profesionales."},
        {"palabra": "Comunidad de habla","definiciones": "Conjunto de personas que comparten patrones lingüísticos y culturales comunes. Estas comunidades se caracterizan por utilizar una variedad de lenguaje similar, comparten normas y valores lingüísticos, y se comunican regularmente entre sí."},
        {"palabra": "Comunidad de práctica","definiciones": "Grupo social donde los individuos comparten intereses, objetivos o actividades específicas, y colaboran en la adquisición y desarrollo de habilidades y conocimientos relacionados con dichas actividades. En el contexto lingüístico, se refiere a grupos que comparten una práctica o contexto de uso del lenguaje común, como profesionales de una disciplina determinada o miembros de un club de lectura."},
        {"palabra": "Comunidad lingüística","definiciones": "Grupo de personas que comparten una lengua o un conjunto de variedades lingüísticas. Estos grupos pueden estar basados en la ubicación geográfica, la cultura, la etnia o incluso la profesión, y comparten patrones lingüísticos que los identifican como miembros de esa comunidad."},
        {"palabra": "Contacto cultural","definiciones": "Interacción entre diferentes culturas que puede influir en las prácticas, valores, tradiciones y, por ende, en el lenguaje. Este contacto puede dar lugar a préstamos lingüísticos, cambios en las estructuras sociales y transformaciones en la manera en que se usan las lenguas."},
        {"palabra": "Contacto lingüístico","definiciones": "Interacción entre dos o más sistemas lingüísticos diferentes. Este contacto puede ocurrir por migración, comercio, colonización u otros tipos de interacciones, dando lugar a fenómenos como el préstamo de palabras, el cambio en la gramática o la aparición de nuevas variedades lingüísticas."},
        {"palabra": "Convergencia lingüística","definiciones": "Proceso en el que diferentes lenguas o variedades lingüísticas se vuelven más similares en términos de estructura, léxico o pronunciación debido al contacto prolongado entre hablantes. Este fenómeno puede llevar a la creación de un lenguaje de contacto o pidgin, que puede eventualmente evolucionar hacia un creole."},
        {"palabra": "Creole","definiciones": "Una lengua que surge del contacto entre diferentes lenguas y se convierte en el idioma nativo de una comunidad. Los creoles suelen tener una gramática simplificada y un léxico derivado de varias lenguas, y se forman como resultado del contacto lingüístico prolongado entre grupos con diferentes idiomas maternos."},
        {"palabra": "Cuestionario sociolingüístico","definiciones": "Instrumento de recolección de datos utilizado en la investigación sociolingüística para recopilar información sobre el uso, actitudes y percepciones lingüísticas de individuos o comunidades. Estos cuestionarios contienen preguntas diseñadas para entender cómo se relacionan los factores sociales con el lenguaje, explorando la diversidad lingüística en distintos contextos sociales y culturales."},
        {"palabra": "Desafueros lingüísticos","definiciones": "Conductas o expresiones que transgreden las normas lingüísticas aceptadas en una comunidad. Estos desafueros pueden manifestarse como errores gramaticales, mal uso de palabras, expresiones inapropiadas o un discurso que va en contra de las convenciones lingüísticas establecidas."},
        {"palabra": "Desaparición lingüística","definiciones": "Proceso por el cual una lengua deja de ser utilizada activamente por una comunidad, perdiendo hablantes hasta que se extingue. Esto puede ocurrir debido a factores como la presión social, la influencia de lenguas dominantes o el cambio en las prácticas culturales, lo que lleva al abandono progresivo de una lengua en favor de otra más dominante."},
        {"palabra": "Desplazamiento lingüístico","definiciones": "Fenómeno en el que una lengua es reemplazada o desplazada por otra en una comunidad determinada. Puede ocurrir debido a factores como la migración, la imposición de políticas lingüísticas, el cambio cultural o la influencia de una lengua dominante, llevando al abandono gradual de una lengua en favor de otra."},
        {"palabra": "Desplazamiento social","definiciones": "Proceso en el que un grupo social pierde su posición o estatus en la sociedad, siendo reemplazado por otro grupo. En el contexto lingüístico, esto puede referirse al cambio en el prestigio o la influencia de un grupo lingüístico en relación con otro, lo que puede impactar el uso y la prevalencia de ciertas lenguas o variedades lingüísticas en una comunidad."},
        {"palabra": "Dialecto","definiciones": "Una variante de una lengua que se distingue por características como vocabulario, pronunciación o gramática. Los dialectos se desarrollan en regiones geográficas específicas o entre grupos sociales y pueden diferir en distintos aspectos lingüísticos."},
        {"palabra": "Dialecto de prestigio","definiciones": "Un dialecto que se percibe como más prestigioso o socialmente valorado dentro de una sociedad en comparación con otras variantes. A menudo se asocia con grupos de élite, instituciones educativas o medios de comunicación y puede tener influencia en contextos formales y oficiales."},
        {"palabra": "Dialecto estándar","definiciones": "Una variante lingüística que se considera la forma aceptada y oficial de una lengua en un país o región. Suele ser enseñado en las escuelas, utilizado en los medios de comunicación y adoptado en documentos oficiales. Es la variante que se busca como referencia para la comunicación formal."},
        {"palabra": "Dialecto geográfico","definiciones": "Un tipo de variación lingüística que ocurre en diferentes regiones geográficas. Se caracteriza por diferencias en el habla dentro de un área geográfica específica, lo que puede incluir variaciones en vocabulario, entonación, pronunciación y estructuras gramaticales."},
        {"palabra": "Dialecto histórico","definiciones": "Una variante lingüística que se ha desarrollado a lo largo del tiempo y que muestra características de una lengua en una etapa anterior de su evolución. Estos dialectos pueden preservar elementos lingüísticos antiguos que han cambiado o desaparecido en la forma actual de la lengua."},
        {"palabra": "Dialecto subordinado","definiciones": "Es una variante regional o social de una lengua que tiene un estatus menor o menos prestigioso en comparación con otro dialecto o variedad dominante. Suele asociarse con grupos sociales menos poderosos o menos valorados en una sociedad."},
        {"palabra": "Dialecto vernáculo","definiciones": "Se refiere al dialecto o variedad lingüística local y cotidiana utilizada por la gente en su entorno habitual. Es el modo de habla común en una región determinada, adoptado por la comunidad en su vida diaria."},
        {"palabra": "Dialectología","definiciones": "Es la rama de la lingüística que se dedica al estudio de los dialectos, investigando las diferencias regionales y sociales en una lengua. Se centra en la descripción, clasificación y distribución geográfica de las variedades lingüísticas."},
        {"palabra": "Diálogo intercultural","definiciones": "Es la comunicación que ocurre entre personas de diferentes culturas, donde se comparten y se intercambian significados, valores y prácticas. Busca comprender y respetar las diferencias culturales y lingüísticas para promover la colaboración y el entendimiento mutuo."},
        {"palabra": "Diasistema","definiciones": "Es un concepto que describe un conjunto de variedades lingüísticas que están interconectadas y relacionadas entre sí. Estas variedades comparten características lingüísticas comunes dentro de un área lingüística específica, pero pueden presentar diferencias significativas en términos de gramática, vocabulario o pronunciación."},
        {"palabra": "Diglosia","definiciones": "Es la coexistencia de dos variedades lingüísticas en una comunidad, donde una se utiliza en situaciones formales (alta) y otra en situaciones informales (baja). La variedad alta suele estar asociada con prestigio, educación o gobierno, mientras que la baja se usa en interacciones cotidianas."},
        {"palabra": "Discontinuidad dialectal","definiciones": "Se refiere a la interrupción abrupta o marcada en las características lingüísticas entre dos áreas geográficas adyacentes. En un mapa dialectal, esta discontinuidad se visualiza como un cambio notable en los rasgos lingüísticos entre regiones cercanas."},
        {"palabra": "Dispersión dialectal","definiciones": "Es la distribución de características lingüísticas particulares a lo largo de un área geográfica extensa. Puede referirse a la propagación de ciertos rasgos dialectales en diferentes direcciones o regiones dentro de una área geográfica más amplia."},
        {"palabra": "Disquisición","definiciones": "Se trata de un discurso o tratado escrito extenso y detallado sobre un tema específico, en este caso, dentro del ámbito lingüístico. Implica una discusión profunda y analítica sobre cuestiones lingüísticas, teóricas o prácticas, a menudo con un enfoque académico riguroso."},
        {"palabra": "Dominio","definiciones": "En el contexto lingüístico, se refiere al nivel de competencia y control que una persona o grupo tiene sobre un idioma o variedad lingüística en diferentes situaciones y áreas de la vida. Indica la habilidad y la capacidad de utilizar una lengua de manera efectiva y adecuada en diversos contextos sociales, culturales o funcionales."},
        {"palabra": "Dominio comunicativo","definiciones": "Se refiere a la habilidad de una persona para utilizar el lenguaje en diferentes situaciones y contextos comunicativos. Incluye la comprensión y producción del lenguaje en diversos escenarios, como en el ámbito académico, social o profesional."},
        {"palabra": "Dominio del lenguaje","definiciones": "La capacidad de una persona para utilizar un idioma de manera efectiva y competente. Esto implica la comprensión de las reglas gramaticales, vocabulario, pronunciación y habilidades de comunicación tanto oral como escrita en un idioma específico."},
        {"palabra": "Dominio funcional","definiciones": "Hace referencia a la destreza de una persona para utilizar el lenguaje de manera práctica y funcional en contextos específicos. Esto implica adaptar el lenguaje según las necesidades comunicativas en situaciones concretas, ya sea para informar, persuadir, expresar emociones, etc."},
        {"palabra": "Dominio lingüístico","definiciones": "Se refiere al conocimiento y control que una persona tiene sobre las estructuras, reglas y características de un idioma particular. Esto incluye la gramática, el vocabulario, la fonología, la morfología y la sintaxis de una lengua."},
        {"palabra": "Ecolingüística","definiciones": "Es el estudio de la interacción entre el lenguaje y el entorno, considerando cómo influye el medio ambiente, la cultura y la sociedad en la forma en que se desarrollan, se usan y evolucionan las lenguas. Explora la relación entre la lengua y el contexto ecológico-cultural, incluyendo la diversidad lingüística y su relación con la conservación del medio ambiente."},
        {"palabra": "Efecto de actitud","definiciones": "Cambio en el lenguaje o la forma de hablar de una persona debido a su actitud hacia un tema o hacia la persona con la que está hablando. Esta actitud puede reflejarse en la elección de palabras, tono de voz o expresiones utilizadas."},
        {"palabra": "Efecto de contacto","definiciones": "Cambio en la lengua o en el uso lingüístico debido al contacto con otra lengua o grupo lingüístico. Puede incluir préstamos lingüísticos, cambios en la pronunciación o gramática debido a la interacción con otro idioma o dialecto."},
        {"palabra": "Endolingüística","definiciones": "Estudio de la adquisición, uso y funcionamiento de la lengua dentro de un individuo o grupo específico. Se enfoca en cómo la lengua se procesa y se usa internamente en la mente de hablantes individuales o en comunidades lingüísticas."},
        {"palabra": "Enunciado","definiciones": "Secuencia coherente de palabras que expresa una idea completa y con sentido. Es la unidad básica del habla o la escritura que transmite información o realiza una acción comunicativa."},
        {"palabra": "Español coloquial","definiciones": "Forma de español utilizada en situaciones informales o cotidianas. Incluye expresiones, palabras o giros más relajados y cercanos, adaptados a contextos de conversación no formales, como charlas entre amigos o interacciones informales."},
        {"palabra": "Español estándar","definiciones": "Forma de español que se considera correcta y aceptada en contextos formales, utilizada en la educación, los medios de comunicación y la literatura."},
        {"palabra": "Español informal","definiciones": "Versión del español utilizada en situaciones cotidianas, más relajada y menos sujeta a las reglas gramaticales estrictas. Se emplea en conversaciones casuales o entre amigos."},
        {"palabra": "Español neutro","definiciones": "Forma del español que busca evitar regionalismos o rasgos lingüísticos particulares, empleada comúnmente en medios de comunicación internacionales o doblajes para llegar a un público más amplio."},
        {"palabra": "Estereotipo lingüístico","definiciones": "Creencias generalizadas o ideas preconcebidas sobre la manera en que hablan ciertos grupos o personas, basadas en su origen étnico, social o geográfico, y que pueden no reflejar la realidad lingüística."},
        {"palabra": "Estigma lingüístico","definiciones": "Asociación negativa o discriminación social hacia ciertas formas de hablar o dialectos que se perciben como no estándar o menos prestigiosos, lo que puede llevar a prejuicios o discriminación basados en el lenguaje utilizado."},
        {"palabra": "Estrategia lingüística","definiciones": "Técnicas o métodos utilizados por hablantes para comunicarse efectivamente en diferentes situaciones. Puede incluir elecciones específicas de palabras, tono o estructuras lingüísticas adaptadas para lograr un propósito comunicativo particular."},
        {"palabra": "Estratificación social","definiciones": "Organización jerárquica de la sociedad en diferentes niveles o estratos basados en factores como la riqueza, la educación o el estatus ocupacional. En sociolingüística, se relaciona con la relación entre el estatus social y el uso del lenguaje."},
        {"palabra": "Estrato social","definiciones": "Cada uno de los niveles jerárquicos dentro de una sociedad, diferenciados por factores como ingresos, educación, ocupación y estatus. En términos lingüísticos, se refiere a cómo estos estratos pueden influir en la manera en que las personas hablan o se comunican."},
        {"palabra": "Etnia lingüística","definiciones": "Grupo étnico o cultural que comparte una lengua común. Esto implica que la identidad étnica está relacionada con la lengua que se habla, y la pertenencia a esa comunidad se define en parte por el uso y la identificación con esa lengua."},
        {"palabra": "Etnografía del habla","definiciones": "Estudio detallado y descriptivo de cómo se utiliza el lenguaje en contextos culturales y sociales específicos. Observa las prácticas lingüísticas, los patrones de habla y las interacciones verbales en una comunidad o grupo social para comprender mejor su significado cultural y social."},
        {"palabra": "Etnografía del habla","definiciones": "Estudio que observa y analiza cómo se usa el lenguaje en contextos culturales específicos, explorando cómo las personas se comunican en situaciones sociales concretas."},
        {"palabra": "Eventos de habla","definiciones": "Son actos específicos de comunicación verbal, como una conversación, un discurso o cualquier intercambio verbal identificable entre hablantes."},
        {"palabra": "Factores extralingüísticos","definiciones": "Son influencias externas al lenguaje que afectan su uso y su forma, como el contexto social, cultural, político o histórico en el que se habla."},
        {"palabra": "Familia lingüística","definiciones": "Grupo de lenguas que tienen un origen común, generalmente se basa en similitudes estructurales y en la historia evolutiva compartida."},
        {"palabra": "Fonología sociolingüística","definiciones": "Estudia cómo los aspectos del sonido del lenguaje (como la pronunciación) se ven afectados por y afectan a la sociedad, las relaciones entre hablantes y los contextos sociales en los que se habla."},
        {"palabra": "Gramática Formal","definiciones": "Es el estudio estructurado de las reglas y principios que rigen la formación de frases y oraciones dentro de una lengua. Se enfoca en la sintaxis, la morfología y la fonología para establecer normas y describir cómo se construyen las expresiones lingüísticas correctas desde un punto de vista teórico y abstracto."},
        {"palabra": "Gramática Social","definiciones": "Se refiere al estudio de cómo se utiliza el lenguaje en contextos sociales y culturales específicos. Examina cómo las reglas gramaticales formales pueden variar según el contexto social, la posición socioeconómica, la edad, el género y otros factores sociales. Se interesa por cómo el lenguaje refleja y afecta las relaciones sociales y la identidad de los hablantes."},
        {"palabra": "Grupo Isolectal","definiciones": "Un conjunto de hablantes que comparten un dialecto o variante lingüística particular dentro de una región o comunidad. Los miembros de un grupo isolectal comparten características lingüísticas similares, como pronunciación, vocabulario y estructuras gramaticales, que los distinguen de otros grupos dentro de la misma área geográfica."},
        {"palabra": "Habla","definiciones": "Se refiere al acto concreto de producir sonidos, palabras y oraciones en un momento específico. Es la manifestación verbal del lenguaje y puede ser individual o colectiva. El habla es el resultado de la interacción entre la gramática de una lengua y la intención comunicativa del hablante en un contexto determinado."},
        {"palabra": "Habla Ritual","definiciones": "Es un tipo específico de habla utilizado en ceremonias, rituales religiosos, eventos tradicionales o sociales significativos. Este tipo de habla tiende a seguir patrones específicos y a menudo se aparta de las formas habituales de comunicación, utilizando fórmulas o estructuras lingüísticas particulares asociadas con el ritual o la ceremonia en cuestión."},
        {"palabra": "Hablante nativo","definiciones": "Persona que ha adquirido una lengua como primera lengua, generalmente durante la infancia, y la utiliza con fluidez y naturalidad. Es alguien que ha crecido en un entorno donde la lengua es hablada de forma cotidiana."},
        {"palabra": "Idiolecto","definiciones": "El conjunto único de patrones lingüísticos, estructuras gramaticales, vocabulario y pronunciación que caracteriza el habla de un individuo en particular. Es la manera única en que una persona utiliza el lenguaje."},
        {"palabra": "Imposición lingüística","definiciones": "La imposición forzada de una lengua o sistema lingüístico sobre otro grupo o individuo. Puede suceder por motivos políticos, culturales o sociales y puede llevar a la supresión o desplazamiento de una lengua nativa."},
        {"palabra": "Inferencia lingüística","definiciones": "Proceso mediante el cual se deduce o se llega a una conclusión sobre el significado de una palabra, frase o texto basado en el contexto lingüístico, cultural o situacional en el que se encuentra."},
        {"palabra": "Interferencia lingüística","definiciones": "Fenómeno en el que las estructuras gramaticales, vocabulario o pronunciación de una lengua influyen o se entremezclan con otra lengua que una persona está aprendiendo o utilizando, principalmente cuando son bilingües. Esto puede causar errores o influencias en el uso del segundo idioma."},
        {"palabra": "Intertextualidad","definiciones": "Se refiere a la relación y la influencia que existe entre diferentes textos. Ocurre cuando un texto hace referencia, cita o se relaciona con otro, ya sea de manera explícita o implícita, creando así una red de conexiones y significados entre obras literarias, culturales o lingüísticas."},
        {"palabra": "Isoglosa","definiciones": "Una línea o frontera geográfica que marca la separación entre áreas donde se hablan diferentes dialectos o variedades lingüísticas. Estas líneas se usan en la dialectología para delimitar regiones lingüísticas y muestran dónde se producen cambios fonéticos, léxicos o gramaticales."},
        {"palabra": "Isolecto","definiciones": "Una variante lingüística específica que es uniforme o similar dentro de una región geográfica o social particular. Se trata de una forma particular de hablar que comparten los habitantes de un área específica y que puede diferenciarse de otras variedades cercanas por ciertos aspectos lingüísticos."},
        {"palabra": "Jerga","definiciones": "Vocabulario especializado o términos propios de un grupo social, profesional o cultural particular. Se trata de un lenguaje informal y técnico que puede ser incomprensible para quienes no son parte de ese grupo. La jerga se utiliza para comunicarse dentro de esa comunidad y a menudo está compuesta por términos abreviados, modificados o específicos de esa área."},
        {"palabra": "Lengua","definiciones": "Un sistema de comunicación verbal propio de una comunidad humana. Es un conjunto organizado de signos lingüísticos (palabras, sonidos, reglas gramaticales, etc.) que se utiliza para expresar ideas, pensamientos y emociones. Una lengua es un sistema complejo que evoluciona, y cada comunidad tiene la suya propia, como el español, inglés, francés, etc."},
        {"palabra": "Lengua criolla","definiciones": "Es una lengua que surge de la mezcla de diferentes idiomas y se convierte en la lengua materna de una comunidad. Se desarrolla principalmente en contextos coloniales donde personas de distintos orígenes lingüísticos se comunican y crean una nueva lengua para la interacción diaria."},
        {"palabra": "Lengua en peligro","definiciones": "Se refiere a una lengua que está en riesgo de desaparecer debido a la disminución en el número de hablantes. Esto puede ser resultado de factores como la presión de una lengua dominante, migración, asimilación cultural o falta de transmisión intergeneracional."},
        {"palabra": "Lengua estándar","definiciones": "Es la variante de una lengua que se considera la forma correcta y aceptada según las normas establecidas. Esta variedad suele ser utilizada en contextos formales, como la educación, la literatura y la administración, y puede estar respaldada por instituciones oficiales o académicas."},
        {"palabra": "Lengua franca","definiciones": "Es una lengua adoptada como medio de comunicación común entre personas cuyas lenguas maternas son diferentes. Se utiliza para facilitar la comunicación en situaciones donde no hay una lengua compartida entre los hablantes y puede ser una lengua nativa o una lengua adquirida para este propósito."},
        {"palabra": "Lengua minoritaria","definiciones": "Es una lengua hablada por una parte más pequeña de la población en una región donde otra lengua es dominante. Estas lenguas pueden tener menos hablantes y corren el riesgo de perderse si no se promueve su uso y transmisión."},
        {"palabra": "Lengua pidgin","definiciones": "Es una lengua simplificada que se desarrolla para la comunicación entre grupos con diferentes idiomas nativos. El pidgin surge en contextos de contacto lingüístico y no es la lengua materna de ningún grupo, pero puede evolucionar a una lengua criolla si se convierte en la lengua principal de una comunidad."},
        {"palabra": "Lengua vernácula","definiciones": "Se refiere a la lengua materna o local hablada por una comunidad en una región específica. Esta lengua suele ser utilizada en el ámbito familiar y cotidiano, reflejando la identidad y la cultura de la comunidad que la utiliza."},
        {"palabra": "Lenguaje","definiciones": "Sistema de comunicación que utiliza sonidos, signos, gestos o escritura para expresar ideas y transmitir información entre individuos."},
        {"palabra": "Lenguaje corporal","definiciones": "Comunicación no verbal que incluye gestos, posturas, movimientos y expresiones faciales que transmiten mensajes e información sin usar palabras."},
        {"palabra": "Lenguaje en contacto","definiciones": "Fenómeno lingüístico que ocurre cuando dos o más lenguas entran en contacto, influyéndose mutuamente debido a la interacción entre hablantes de diferentes idiomas."},
        {"palabra": "Lenguaje no verbal","definiciones": "Comunicación que no se basa en palabras habladas o escritas, incluyendo gestos, expresiones faciales, posturas y movimientos corporales para transmitir información."},
        {"palabra": "Lenguaje paralenguaje","definiciones": "Elementos no verbales de la comunicación oral que acompañan al lenguaje hablado, como el tono de voz, la entonación, la velocidad y el volumen, que pueden afectar el significado de lo que se dice."},
        {"palabra": "Lingüística antropológica","definiciones": "Área de la lingüística que estudia la relación entre el lenguaje y la cultura, centrándose en cómo las prácticas lingüísticas se entrelazan con la vida social y cultural de una sociedad."},
        {"palabra": "Lingüística cognitiva","definiciones": "Campo de la lingüística que investiga cómo se procesa y se organiza el lenguaje en la mente humana, analizando la relación entre el pensamiento y la estructura lingüística."},
        {"palabra": "Lingüística contrastiva","definiciones": "Estudio que compara dos o más lenguas para identificar similitudes y diferencias, analizando cómo estas diferencias afectan el aprendizaje y la traducción entre idiomas."},
        {"palabra": "Lingüística de corpus","definiciones": "Método de análisis lingüístico que se basa en grandes colecciones de textos escritos o hablados (corpus) para estudiar patrones lingüísticos y frecuencias de uso."},
        {"palabra": "Lingüística diacrónica","definiciones": "Enfoque de la lingüística que se centra en el cambio y la evolución histórica de las lenguas, estudiando cómo han cambiado a lo largo del tiempo y las razones detrás de esos cambios."},
        {"palabra": "Lingüística etnográfica","definiciones": "Un enfoque de estudio lingüístico que examina cómo el lenguaje se entrelaza con la cultura y las prácticas sociales de una comunidad o grupo étnico. Se centra en las observaciones detalladas de situaciones cotidianas y contextos culturales para comprender mejor el uso del lenguaje."},
        {"palabra": "Lingüística formal","definiciones": "Un enfoque que analiza la estructura y la forma del lenguaje a través de modelos matemáticos y teorías abstractas. Se preocupa por describir y analizar la gramática, la sintaxis, la morfología y otras características lingüísticas desde un punto de vista estructural."},
        {"palabra": "Lingüística generativa","definiciones": "Un enfoque que se centra en la generación de estructuras gramaticales y reglas implícitas que subyacen al lenguaje humano. Se basa en la idea de que existe una gramática innata en la mente humana que permite la producción infinita de oraciones gramaticalmente correctas."},
        {"palabra": "Lingüística histórica","definiciones": "Estudia la evolución y el cambio de las lenguas a lo largo del tiempo. Analiza cómo las lenguas cambian, se desarrollan y se relacionan entre sí a lo largo de diferentes períodos históricos, investigando los vínculos entre lenguas relacionadas y los cambios en su estructura."},
        {"palabra": "Lingüística interaccional","definiciones": "Se enfoca en el análisis de la comunicación en situaciones de interacción entre hablantes. Examina cómo se desarrolla el lenguaje en contextos conversacionales, considerando elementos como el turno de habla, la estructura de las conversaciones y la cooperación entre interlocutores."},
        {"palabra": "Lingüística matemática","definiciones": "Utiliza herramientas y métodos matemáticos para el análisis y la modelización de fenómenos lingüísticos. Emplea modelos estadísticos, algoritmos y técnicas matemáticas para estudiar la estructura del lenguaje y los patrones lingüísticos."},
        {"palabra": "Lingüística mentalista","definiciones": "Se centra en la comprensión de los procesos mentales subyacentes a la producción y comprensión del lenguaje humano. Investiga cómo se almacena, procesa y utiliza el lenguaje en la mente humana desde una perspectiva cognitiva."},
        {"palabra": "Lingüística pedagógica","definiciones": "Se ocupa del estudio y la aplicación de teorías lingüísticas en el ámbito educativo. Enfoca en cómo enseñar y aprender lenguajes, desarrollando estrategias didácticas y metodologías para la enseñanza de idiomas."},
        {"palabra": "Lingüística pragmática","definiciones": "Analiza cómo se utiliza el lenguaje en contextos reales para comunicarse eficazmente. Estudia la relación entre el lenguaje y el contexto, centrándose en cómo se usan las palabras en situaciones concretas para expresar intenciones y significados."},
        {"palabra": "Lingüística sincrónica","definiciones": "Se enfoca en el estudio de una lengua en un momento específico, sin considerar su desarrollo histórico. Analiza la estructura y las características de una lengua en un período determinado, sin tomar en cuenta su evolución temporal."},
        {"palabra": "Lingüística Teórica","definiciones": "Un campo de la lingüística que se enfoca en desarrollar teorías y modelos abstractos para entender cómo funciona el lenguaje en general, explorando estructuras, reglas y principios subyacentes en todas las lenguas."},
        {"palabra": "Lingüística Textual","definiciones": "La rama de la lingüística que analiza cómo se estructuran y organizan los textos, centrándose en la coherencia, cohesión, estructuras narrativas y estrategias discursivas utilizadas para crear significado en un texto."},
        {"palabra": "Marcador Social","definiciones": "Un elemento lingüístico, como una palabra o una estructura gramatical, que indica la pertenencia a un grupo social específico o refleja el estatus social del hablante en una comunidad determinada."},
        {"palabra": "Mercado Lingüístico","definiciones": "El entorno en el que las lenguas y sus variantes compiten por su uso y valoración en contextos sociales, culturales, económicos y políticos, afectando la percepción y el prestigio de las lenguas."},
        {"palabra": "Monolingüe","definiciones": "Una persona o comunidad que habla solo una lengua, sin competencia en otros idiomas."},
        {"palabra": "Multilingüe","definiciones": "Individuo o comunidad que posee habilidades en varias lenguas, pudiendo comunicarse y comprender más de un idioma."},
        {"palabra": "Norma Académica","definiciones": "Conjunto de reglas y convenciones establecidas por instituciones educativas o académicas que definen el uso correcto del lenguaje en contextos formales, como la escritura académica."},
        {"palabra": "Norma Lingüística","definiciones": "Reglas y convenciones establecidas socialmente que definen lo que se considera correcto o estándar en una lengua, determinando su uso aceptado en una comunidad lingüística."},
        {"palabra": "Normalización Lingüística","definiciones": "Proceso mediante el cual se establece una lengua o variedad específica como norma estándar, generalmente con el respaldo de políticas educativas o institucionales."},
        {"palabra": "Papel Social del Lenguaje","definiciones": "La función del lenguaje en la sociedad, incluyendo cómo se utiliza para expresar identidad, mantener relaciones sociales, transmitir información y reflejar la estructura y dinámica de una comunidad."},
        {"palabra": "Percepción del habla","definiciones": "Proceso en el que los individuos interpretan y comprenden los sonidos del habla, incluyendo la identificación de fonemas, acentos, entonación y ritmo del discurso."},
        {"palabra": "Préstamo lingüístico","definiciones": "Proceso mediante el cual una lengua toma palabras o expresiones de otra lengua y las incorpora a su propio vocabulario, adaptándolas a su fonología y gramática."},
        {"palabra": "Prestigio lingüístico","definiciones": "Valoración social positiva que se otorga a una variedad o forma específica de lenguaje, generalmente asociada con estatus social, educativo o cultural."},
        {"palabra": "Proceso de estandarización","definiciones": "Conjunto de acciones que buscan establecer una norma o estándar en una lengua, incluyendo la definición de reglas gramaticales, ortográficas y léxicas para su uso formal y oficial."},
        {"palabra": "Recuperación lingüística","definiciones": "Esfuerzo o proceso dirigido a revitalizar o revivir una lengua que se encuentra en peligro de desaparición o en declive."},
        {"palabra": "Reestructuración lingüística","definiciones": "Cambios significativos en la estructura o el sistema de una lengua, que pueden incluir modificaciones gramaticales, fonológicas o léxicas a lo largo del tiempo."},
        {"palabra": "Registro lingüístico","definiciones": "Variación en el lenguaje utilizada en diferentes situaciones o contextos comunicativos, que varía desde formal a informal, marcando niveles de cortesía, grado de familiaridad o contexto social."},
        {"palabra": "Reglas inmanentes","definiciones": "Reglas o patrones lingüísticos inherentes a una lengua, estructuras y principios internos que gobiernan la formación de palabras y oraciones."},
        {"palabra": "Situación del habla","definiciones": "Contexto específico en el que se produce la comunicación verbal, incluyendo factores como participantes, ubicación, propósito y tema de la conversación."},
        {"palabra": "Sociolecto","definiciones": "Variedad lingüística asociada con un grupo social o una comunidad específica, caracterizada por el uso de ciertas formas de lenguaje que reflejan la identidad social, cultural o económica del grupo."},
        {"palabra": "Sociolingüística","definiciones": "Estudio de la relación entre la lengua y la sociedad, incluyendo cómo factores sociales como la cultura, la clase social y el contexto afectan al lenguaje y su uso."},
        {"palabra": "Sustrato lingüístico","definiciones": "Influencia de una lengua anterior en otra debido al contacto entre hablantes de diferentes lenguas, especialmente cuando una lengua influye en la estructura o el vocabulario de otra."},
        {"palabra": "Tabú lingüístico","definiciones": "Palabra o expresión considerada inapropiada, ofensiva o socialmente inaceptable en una determinada cultura o sociedad, por lo que se evita su uso."},
        {"palabra": "Transferencia lingüística","definiciones": "Uso de conocimientos de una lengua para aprender o influir en otra lengua, incluyendo la transferencia de patrones lingüísticos o estructuras de una lengua a otra."},
        {"palabra": "Variación diafásica","definiciones": "Cambios en el lenguaje según el contexto o el registro, como el uso de diferentes estilos o registros lingüísticos según la situación comunicativa."},
        {"palabra": "Variación diastrática","definiciones": "Variación lingüística asociada con diferentes grupos sociales, como diferencias en el lenguaje entre clases sociales, edades o géneros."},
        {"palabra": "Variación diatópica","definiciones": "Variación lingüística según la geografía o la ubicación geográfica, que se manifiesta en diferentes dialectos o variantes lingüísticas en regiones específicas."},
        {"palabra": "Variación estilística","definiciones": "Diferencias en el lenguaje relacionadas con diferentes estilos de comunicación, adaptados a contextos formales, informales, literarios, entre otros."},
        {"palabra": "Variación geográfica","definiciones": "Diferencias lingüísticas basadas en la ubicación geográfica, dando lugar a dialectos o variantes regionales específicas dentro de una lengua."},
        {"palabra": "Variación lingüística","definiciones": "Diversidad en el lenguaje que incluye todas las formas de variación: diafásica, diastrática, diatópica, estilística, geográfica, entre otras, que influyen en la forma en que se habla una lengua."},
        {"palabra": "Variación social","definiciones": "La manera en que el lenguaje varía según los diferentes grupos sociales, como diferencias en el vocabulario, la pronunciación o las estructuras gramaticales, relacionadas con factores como la edad, el género, la ocupación o el estatus socioeconómico."},
        {"palabra": "Variación sociolingüística","definiciones": "La diversidad en el lenguaje que se relaciona con factores sociales, culturales y contextuales. Esta variación abarca diferencias en el habla según la región, grupo étnico, edad, género y otros aspectos sociales."},
        {"palabra": "Variante del uso","definiciones": "Una forma particular en que se emplea el lenguaje dentro de un contexto específico, considerando las diferencias en la comunicación en situaciones formales e informales, en diversos ámbitos sociales o culturales."},
        {"palabra": "Variante lingüística","definiciones": "Una versión específica de una lengua que presenta diferencias en términos de fonología, gramática, léxico o pragmática, generalmente asociada con una región, grupo social o contexto de uso."},
        {"palabra": "Variedad del uso","definiciones": "Diferencias en el lenguaje que se observan en distintas situaciones comunicativas o contextos, como el registro formal o informal, el lenguaje técnico o coloquial, entre otros."},
        {"palabra": "Variedad dialectal","definiciones": "Una forma específica del lenguaje que se distingue por diferencias regionales, donde se pueden encontrar variaciones en la pronunciación, vocabulario y gramática dentro de una lengua más amplia."},
        {"palabra": "Variedad estándar","definiciones": "La forma aceptada y considerada como 'correcta' o normativa dentro de una lengua, generalmente asociada con la educación formal, la escritura académica y la comunicación oficial."},
        {"palabra": "Variedad regional","definiciones": "Variaciones lingüísticas que se encuentran dentro de una región geográfica específica, caracterizadas por diferencias en el habla, la pronunciación o el vocabulario."},
        {"palabra": "Variedad social","definiciones": "Diferencias en el uso del lenguaje asociadas con grupos sociales particulares, como grupos étnicos, niveles socioeconómicos o profesionales, que pueden influir en el estilo y las formas de expresión lingüística."}
        ]
    }